Tekla Open API Reference for Tekla Structures 2025
ISolid Properties
The ISolid type exposes the following members.
Properties
Name | Description
MaximumPoint
 The maximum axis-aligned point of the solid in the current plane.
MinimumPoint
 The minimum axis-aligned point of the solid in the current plane.
Top
See Also
Reference
ISolid Interface
Tekla.Structures.Solid Namespace